<template>
<div>
<p>サービスのご利用誠にありがとうございます．本文章はこのサイトを利用する上で，守っていただきたいルールや，免責事項を示すものです．</p>
<p>ご利用の際には必ずご一読お願いいたします．</p>
<h2 id="1-概要" class="mb-5 mt-9">1. 概要</h2>
<p>Web Bash(以下 本サービス)は，Web上で簡易的なシェルスクリプトを実行するアプリケーションであり，ドメインは <a href="https://bash.chomama.jp">https://bash.chomama.jp</a> です．</p>
<p>以下に示す規約はすべての利用者に適用されます．</p>
<h2 id="2-個人情報の取り扱いプライバシーポリシー" class="mb-5 mt-9">2. 個人情報の取り扱い(プライバシーポリシー)</h2>
<h3 class="mt-5 mb-4" id="21-定義">2.1. 定義</h3>
<p>個人情報とは，個人に関する情報であり，氏名や生年月日等，他の容易に参照できる情報との照合により特定個人の識別を行えるものを指します．</p>
<h3 class="mt-5 mb-4" id="22-個人情報保護方針">2.2. 個人情報保護方針</h3>
<p>本サービスでは個人情報の保護に際し，以下の事項を誓約します．</p>
<ol>
<li>個人情報保護に関する法律，及び関連法令等の定める条令を遵守するとともに，公正に個人情報を取り扱います．</li>
<li>個人情報取得の際には，利用目的を明確にし，必要な際にはその利用に関する同意を得た上で，その利用目的に従って個人情報を取り扱います．</li>
<li>個人情報の漏洩，棄損を防ぐため，技術的安全措置を講じます．また，脆弱性等の発見により安全面に不適合が生じた際には迅速にその原因を排斥し是正いたします．</li>
</ol>
<h3 class="mt-5 mb-4" id="23-登録情報">2.3. 登録情報</h3>
<h4 class="mt-2 mb-2" id="twitterアカウント情報">Twitterアカウント情報</h4>
<p>本サイトの一部サービスの利用のためにTwitterのアカウントデータを利用しています．外部認証の際にユーザIDとパスワードを訊かれますが，本サービスではユーザ個人のパスワード情報は一切扱いません．</p>
<p>また，認証時にTwitterのデータを取得できるアクセストークンが発行されますが，このデータはユーザの同一性を確認するためのみに利用し，確認後は即座に破棄されます．</p>
<h4 class="mt-2 mb-2" id="ipアドレス">IPアドレス</h4>
<p>特定個人による過剰なアクセスを防ぐために，発信元のIPアドレスが保管されます．発信元確認以外の用途で使用することはありません．</p>
<h4 class="mt-2 mb-2">Cookie</h4>
<p>当サービスにおいて，ユーザの認証及び認可を行うために当サービスでのみ利用可能であるアクセストークンが発行されます．アクセストークン情報はCookieに登録されます．Cookieを利用しない設定を行うことで，このデータの送受信が行われなくなりますが，その際には認可を伴うサービスの利用はできません．あらかじめご了承ください．</p>
<h3 class="mt-5 mb-4" id="24-個人情報の提供">2.4. 個人情報の提供</h3>
<p>本サービスに保管されている個人情報は，公的機関による法令に基づいた要請があった場合にのみ第三者に提供されます．</p>
<h2 id="3-著作物の取り扱い" class="mb-5 mt-9">3. 著作物の取り扱い</h2>
<ul>
<li>本サービスに投稿されたユーザコンテンツの著作権はすべて利用者自身に属しますが，本サーバ上にデータが保管され，検索表示や一覧表示等の画面で利用されます．</li>
<li>本サービスに投稿されたメディアデータはすべて第三者の権利を侵害するもの出ないことを保証し，利用者はこれに同意した場合にのみサービスを利用することができます．</li>
<li>上記の件において，第三者間との権利侵害等を理由とする紛争が発生した場合，本サービスは一切の責任を負いかねます．</li>
</ul>
<h2 id="4-禁止事項" class="mb-5 mt-9">4. 禁止事項</h2>
<ol>
<li>本サービスを利用するにあたり以下に示す行為を行うことを禁じます．<ol>
<li>個人のプライバシーや肖像権を侵害する，もしくは侵害する恐れのある行為</li>
<li>特定個人や法人に対する，名誉の毀損や差別，誹謗中傷など精神的に障害を与えるもしくは与える恐れのある行為</li>
<li>法令，公序良俗に反する行為</li>
<li>本サービスを運営するサーバに対し，過剰なトラフィック等により著しく負荷をかけ，他の利用者の利用やサーバー運営を妨げる行為</li>
<li>本サービスが提供するシステム以外でデータを取得する行為</li>
<li>その他，本サービスの運営上不適切であると判断される行為</li>
</ol>
</li>
<li>以上に示す事項を遵守した上で本サービスを利用することができます．また，本サービスを利用した場合，以上に示した事項に違反した場合，アクセスの制限やアカウントの停止，本サービス内でのユーザデータの削除等の処置，及び本サービスが何らかの損害を被ったと本サービスが判断した場合，利用者に対する損害賠償の請求処置が行われることを同意したものとします．</li>
</ol>
<h2 id="5-免責事項" class="mb-5 mt-9">5. 免責事項</h2>
<ol>
<li>本サービスを提供するすべての機能に対し，事前に予告を行ったかに関わらず本サイトに記載されている情報を変更や削除，追加をする場合がございます．</li>
<li>本サービスの機能を利用されたことで直接・間接的に生じた損失に関し本サービスは一切責任を負うものではありません．</li>
<li>当サービスに投稿されたユーザデータのうち，誹謗中傷やスパム，法律に違反する物品や行為の依頼や斡旋，及び本運営が不適と判断したものについては事前通告をなしに削除いたします．</li>
<li>事前予告なしに，本サービスのメンテナンスや停止を行う場合があります．</li>
<li>本規約は本サービス上での告知ののち，変更されることがあります．</li>
</ol>
<h2 id="6-準拠法及び裁判管轄" class="mb-5 mt-9">6. 準拠法及び裁判管轄</h2>
<p>本規約の解釈については日本法を準拠法とし，東京地方裁判所を専属的合意管轄裁判所とします．</p>
<p>発効日: 2020年7月1日</p>
</div>
</template>

<script lang="ts">
import { Vue, Component } from "vue-property-decorator";

@Component
class TOS extends Vue {}
export default TOS;
</script>

<style scoped>
p {
  margin-right: 1em !important;
}
</style>
